Revit 2027 API
GenericZone.OccupiedArea Property
 The occupied area for the zone, in square feet.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OccupiedArea { get; }
Public ReadOnly Property OccupiedArea As Double
	Get
public:
property double OccupiedArea {
	double get ();
}
member OccupiedArea : float with get
Property Value
Double
Remarks
 The occupied area of a space-based zone is the sum of the areas of the spaces marked Occupiable in the zone. This property will return a value of zero for zones where this type of area isn't applicable.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace